levizh/hc32-f4-cmsis/Device/HDSC/hc32f334/Include/hc32f334.h
/**
 *******************************************************************************
 ** \brief Interrupt number enumeration
 ******************************************************************************/
typedef enum {
    INT_SRC_SWI_IRQ0             = 0U,
    INT_SRC_SWI_IRQ1             = 1U,
    INT_SRC_SWI_IRQ2             = 2U,
    INT_SRC_SWI_IRQ3             = 3U,
    INT_SRC_SWI_IRQ4             = 4U,
    INT_SRC_SWI_IRQ5             = 5U,
    INT_SRC_SWI_IRQ6             = 6U,
    INT_SRC_SWI_IRQ7             = 7U,
    INT_SRC_SWI_IRQ8             = 8U,
    INT_SRC_SWI_IRQ9             = 9U,
    INT_SRC_SWI_IRQ10            = 10U,
    INT_SRC_SWI_IRQ11            = 11U,
    INT_SRC_SWI_IRQ12            = 12U,
    INT_SRC_SWI_IRQ13            = 13U,
    INT_SRC_SWI_IRQ14            = 14U,
    INT_SRC_SWI_IRQ15            = 15U,
    INT_SRC_SWI_IRQ16            = 16U,
    INT_SRC_SWI_IRQ17            = 17U,
    INT_SRC_SWI_IRQ18            = 18U,
    INT_SRC_SWI_IRQ19            = 19U,
    INT_SRC_SWI_IRQ20            = 20U,
    INT_SRC_SWI_IRQ21            = 21U,
    INT_SRC_SWI_IRQ22            = 22U,
    INT_SRC_SWI_IRQ23            = 23U,
    INT_SRC_SWI_IRQ24            = 24U,
    INT_SRC_SWI_IRQ25            = 25U,
    INT_SRC_SWI_IRQ26            = 26U,
    INT_SRC_SWI_IRQ27            = 27U,
    INT_SRC_SWI_IRQ28            = 28U,
    INT_SRC_SWI_IRQ29            = 29U,
    INT_SRC_SWI_IRQ30            = 30U,
    INT_SRC_SWI_IRQ31            = 31U,
    /*  External Interrupt   */
    INT_SRC_PORT_EIRQ0           = 0U,      /* EIRQ0  */
    INT_SRC_PORT_EIRQ1           = 1U,      /* EIRQ1  */
    INT_SRC_PORT_EIRQ2           = 2U,      /* EIRQ2  */
    INT_SRC_PORT_EIRQ3           = 3U,      /* EIRQ3  */
    INT_SRC_PORT_EIRQ4           = 4U,      /* EIRQ4  */
    INT_SRC_PORT_EIRQ5           = 5U,      /* EIRQ5  */
    INT_SRC_PORT_EIRQ6           = 6U,      /* EIRQ6  */
    INT_SRC_PORT_EIRQ7           = 7U,      /* EIRQ7  */
    INT_SRC_PORT_EIRQ8           = 8U,      /* EIRQ8  */
    INT_SRC_PORT_EIRQ9           = 9U,      /* EIRQ9  */
    INT_SRC_PORT_EIRQ10          = 10U,     /* EIRQ10 */
    INT_SRC_PORT_EIRQ11          = 11U,     /* EIRQ11 */
    INT_SRC_PORT_EIRQ12          = 12U,     /* EIRQ12 */
    INT_SRC_PORT_EIRQ13          = 13U,     /* EIRQ13 */
    INT_SRC_PORT_EIRQ14          = 14U,     /* EIRQ14 */
    INT_SRC_PORT_EIRQ15          = 15U,     /* EIRQ15 */
    /*  DMA  */
    INT_SRC_DMA_ERR              = 32U,     /* DMA_ERR  */
    INT_SRC_DMA_TC0              = 33U,     /* DMA_TC0  */
    INT_SRC_DMA_BTC0             = 34U,     /* DMA_BTC0 */
    INT_SRC_DMA_TC1              = 35U,     /* DMA_TC1  */
    INT_SRC_DMA_BTC1             = 36U,     /* DMA_BTC1 */
    INT_SRC_DMA_TC2              = 37U,     /* DMA_TC2  */
    INT_SRC_DMA_BTC2             = 38U,     /* DMA_BTC2 */
    INT_SRC_DMA_TC3              = 39U,     /* DMA_TC3  */
    INT_SRC_DMA_BTC3             = 40U,     /* DMA_BTC3 */
    INT_SRC_DMA_TC4              = 41U,     /* DMA_TC4  */
    INT_SRC_DMA_BTC4             = 42U,     /* DMA_BTC4 */
    INT_SRC_DMA_TC5              = 43U,     /* DMA_TC5  */
    INT_SRC_DMA_BTC5             = 44U,     /* DMA_BTC5 */
    INT_SRC_DMA_TC6              = 45U,     /* DMA_TC6  */
    INT_SRC_DMA_BTC6             = 46U,     /* DMA_BTC6 */
    INT_SRC_DMA_TC7              = 47U,     /* DMA_TC7  */
    INT_SRC_DMA_BTC7             = 48U,     /* DMA_BTC7 */
    /*  EFM  */
    INT_SRC_EFM_PEERR            = 49U,     /* EFM_PEERR  */
    INT_SRC_EFM_RDCOL            = 50U,     /* EFM_RDCOL  */
    INT_SRC_EFM_OPTEND           = 51U,     /* EFM_OPTEND */
    /*  FPU  */
    INT_SRC_FPU_ERR              = 63U,     /* FPU_ERR    */
    /*  TIMER0  */
    INT_SRC_TMR0_1_CMP_A         = 96U,     /* TMR0_1_CMPA */
    INT_SRC_TMR0_1_CMP_B         = 97U,     /* TMR0_1_CMPB */
    INT_SRC_TMR0_1_OVF_A         = 98U,     /* TMR0_1_OVFA */
    INT_SRC_TMR0_1_OVF_B         = 99U,     /* TMR0_1_OVFB */
    INT_SRC_TMR0_2_CMP_A         = 100U,    /* TMR0_2_CMPA */
    INT_SRC_TMR0_2_CMP_B         = 101U,    /* TMR0_2_CMPB */
    INT_SRC_TMR0_2_OVF_A         = 102U,    /* TMR0_2_OVFA */
    INT_SRC_TMR0_2_OVF_B         = 103U,    /* TMR0_2_OVFB */
    /*  RTC  */
    INT_SRC_RTC_TP               = 120U,     /* RTC_TP */
    INT_SRC_RTC_ALM              = 121U,     /* RTC_ALM */
    INT_SRC_RTC_PRD              = 122U,     /* RTC_PRD */
    /*  XTAL  */
    INT_SRC_XTAL_STOP            = 125U,     /* XTAL_STOP */
    /*  WKTM  */
    INT_SRC_WKTM_PRD             = 126U,     /* WKTM_PRD */
    /*  SWDT  */
    INT_SRC_SWDT_REFUDF          = 127U,     /* SWDT_REFUDF */
    /*  TIMER6_1  */
    INT_SRC_TMR6_1_GCMP_A        = 128U,     /* TMR6_1_GCMA */
    INT_SRC_TMR6_1_GCMP_B        = 129U,     /* TMR6_1_GCMB */
    INT_SRC_TMR6_1_GCMP_C        = 130U,     /* TMR6_1_GCMC */
    INT_SRC_TMR6_1_GCMP_D        = 131U,     /* TMR6_1_GCMD */
    INT_SRC_TMR6_1_GCMP_E        = 132U,     /* TMR6_1_GCME */
    INT_SRC_TMR6_1_GCMP_F        = 133U,     /* TMR6_1_GCMF */
    INT_SRC_TMR6_1_OVF           = 134U,     /* TMR6_1_GOVF */
    INT_SRC_TMR6_1_UDF           = 135U,     /* TMR6_1_GUDF */
    INT_SRC_TMR6_1_DTE           = 136U,     /* TMR6_1_GDTE */
    INT_SRC_TMR6_1_SCMP_A        = 137U,     /* TMR6_1_SCMA */
    INT_SRC_TMR6_1_SCMP_B        = 138U,     /* TMR6_1_SCMB */
    /*  TIMERA_1  */
    INT_SRC_TMRA_1_OVF           = 139U,     /* TMRA_1_OVF */
    INT_SRC_TMRA_1_UDF           = 140U,     /* TMRA_1_UDF */
    INT_SRC_TMRA_1_CMP           = 141U,     /* TMRA_1_CMP */
    /*  TIMER6_2  */
    INT_SRC_TMR6_2_GCMP_A        = 144U,     /* TMR6_2_GCMA */
    INT_SRC_TMR6_2_GCMP_B        = 145U,     /* TMR6_2_GCMB */
    INT_SRC_TMR6_2_GCMP_C        = 146U,     /* TMR6_2_GCMC */
    INT_SRC_TMR6_2_GCMP_D        = 147U,     /* TMR6_2_GCMD */
    INT_SRC_TMR6_2_GCMP_E        = 148U,     /* TMR6_2_GCME */
    INT_SRC_TMR6_2_GCMP_F        = 149U,     /* TMR6_2_GCMF */
    INT_SRC_TMR6_2_OVF           = 150U,     /* TMR6_2_GOVF */
    INT_SRC_TMR6_2_UDF           = 151U,     /* TMR6_2_GUDF */
    INT_SRC_TMR6_2_DTE           = 152U,     /* TMR6_2_GDTE */
    INT_SRC_TMR6_2_SCMP_A        = 153U,     /* TMR6_2_SCMA */
    INT_SRC_TMR6_2_SCMP_B        = 154U,     /* TMR6_2_SCMB */
    /*  TIMERA_2  */
    INT_SRC_TMRA_2_OVF           = 155U,     /* TMRA_2_OVF */
    INT_SRC_TMRA_2_UDF           = 156U,     /* TMRA_2_UDF */
    INT_SRC_TMRA_2_CMP           = 157U,     /* TMRA_2_CMP */
    /*  TIMER6_3  */
    INT_SRC_TMR6_3_GCMP_A        = 160U,     /* TMR6_3_GCMA */
    INT_SRC_TMR6_3_GCMP_B        = 161U,     /* TMR6_3_GCMB */
    INT_SRC_TMR6_3_GCMP_C        = 162U,     /* TMR6_3_GCMC */
    INT_SRC_TMR6_3_GCMP_D        = 163U,     /* TMR6_3_GCMD */
    INT_SRC_TMR6_3_GCMP_E        = 164U,     /* TMR6_3_GCME */
    INT_SRC_TMR6_3_GCMP_F        = 165U,     /* TMR6_3_GCMF */
    INT_SRC_TMR6_3_OVF           = 166U,     /* TMR6_3_GOVF */
    INT_SRC_TMR6_3_UDF           = 167U,     /* TMR6_3_GUDF */
    INT_SRC_TMR6_3_DTE           = 168U,     /* TMR6_3_GDTE */
    INT_SRC_TMR6_3_SCMP_A        = 169U,     /* TMR6_3_SCMA */
    INT_SRC_TMR6_3_SCMP_B        = 170U,     /* TMR6_3_SCMB */
    /*  TIMERA_3  */
    INT_SRC_TMRA_3_OVF           = 171U,     /* TMRA_3_OVF */
    INT_SRC_TMRA_3_UDF           = 172U,     /* TMRA_3_UDF */
    INT_SRC_TMRA_3_CMP           = 173U,     /* TMRA_3_CMP */
    /*  TIMER6_4 */
    INT_SRC_TMR6_4_GCMP_A        = 176U,     /* TMR6_4_GCMA */
    INT_SRC_TMR6_4_GCMP_B        = 177U,     /* TMR6_4_GCMB */
    INT_SRC_TMR6_4_GCMP_C        = 178U,     /* TMR6_4_GCMC */
    INT_SRC_TMR6_4_GCMP_D        = 179U,     /* TMR6_4_GCMD */
    INT_SRC_TMR6_4_GCMP_E        = 180U,     /* TMR6_4_GCME */
    INT_SRC_TMR6_4_GCMP_F        = 181U,     /* TMR6_4_GCMF */
    INT_SRC_TMR6_4_OVF           = 182U,     /* TMR6_4_GOVF */
    INT_SRC_TMR6_4_UDF           = 183U,     /* TMR6_4_GUDF */
    INT_SRC_TMR6_4_DTE           = 184U,     /* TMR6_4_GDTE */
    INT_SRC_TMR6_4_SCMP_A        = 185U,     /* TMR6_4_SCMA */
    INT_SRC_TMR6_4_SCMP_B        = 186U,     /* TMR6_4_SCMB */
    /*  TIMERA_4  */
    INT_SRC_TMRA_4_OVF           = 187U,     /* TMRA_4_OVF */
    INT_SRC_TMRA_4_UDF           = 188U,     /* TMRA_4_UDF */
    INT_SRC_TMRA_4_CMP           = 189U,     /* TMRA_4_CMP */
    /*  HRPWM_1 */
    INT_SRC_HRPWM_1_GCMP_A       = 192U,     /* HRPWM_1_GCMA */
    INT_SRC_HRPWM_1_GCMP_B       = 193U,     /* HRPWM_1_GCMB */
    INT_SRC_HRPWM_1_GCMP_C       = 194U,     /* HRPWM_1_GCMC */
    INT_SRC_HRPWM_1_GCMP_D       = 195U,     /* HRPWM_1_GCMD */
    INT_SRC_HRPWM_1_GCMP_E       = 196U,     /* HRPWM_1_GCME */
    INT_SRC_HRPWM_1_GCMP_F       = 197U,     /* HRPWM_1_GCMF */
    INT_SRC_HRPWM_1_OVF          = 198U,     /* HRPWM_1_GOVF */
    INT_SRC_HRPWM_1_UDF          = 199U,     /* HRPWM_1_GUDF */
    INT_SRC_HRPWM_1_SCMP_A       = 200U,     /* HRPWM_1_SCMA */
    INT_SRC_HRPWM_1_SCMP_B       = 201U,     /* HRPWM_1_SCMB */
    INT_SRC_HRPWM_1_GCAP_A       = 202U,     /* HRPWM_1_GCAPA */
    INT_SRC_HRPWM_1_GCAP_B       = 203U,     /* HRPWM_1_GCAPB */
    /*  HRPWM_2 */
    INT_SRC_HRPWM_2_GCMP_A       = 204U,     /* HRPWM_2_GCMA */
    INT_SRC_HRPWM_2_GCMP_B       = 205U,     /* HRPWM_2_GCMB */
    INT_SRC_HRPWM_2_GCMP_C       = 206U,     /* HRPWM_2_GCMC */
    INT_SRC_HRPWM_2_GCMP_D       = 207U,     /* HRPWM_2_GCMD */
    INT_SRC_HRPWM_2_GCMP_E       = 208U,     /* HRPWM_2_GCME */
    INT_SRC_HRPWM_2_GCMP_F       = 209U,     /* HRPWM_2_GCMF */
    INT_SRC_HRPWM_2_OVF          = 210U,     /* HRPWM_2_GOVF */
    INT_SRC_HRPWM_2_UDF          = 211U,     /* HRPWM_2_GUDF */
    INT_SRC_HRPWM_2_SCMP_A       = 212U,     /* HRPWM_2_SCMA */
    INT_SRC_HRPWM_2_SCMP_B       = 213U,     /* HRPWM_2_SCMB */
    INT_SRC_HRPWM_2_GCAP_A       = 214U,     /* HRPWM_2_GCAPA */
    INT_SRC_HRPWM_2_GCAP_B       = 215U,     /* HRPWM_2_GCAPB */
    /* HRPWM_BCD  */
    INT_SRC_HRPWM_BMOVF          = 216U,     /* HRPWM_BMOVF */
    INT_SRC_HRPWM_CALENF         = 217U,     /* HRPWM_CALENF */
    INT_SRC_HRPWM_DLYPRT         = 218U,     /* HRPWM_DLYPRT */
    /*  EMB_0_3  */
    INT_SRC_EMB_GR0              = 220U,     /* EMB_GR0 */
    INT_SRC_EMB_GR1              = 221U,     /* EMB_GR1 */
    INT_SRC_EMB_GR2              = 222U,     /* EMB_GR2 */
    INT_SRC_EMB_GR3              = 223U,     /* EMB_GR3 */
    /*  HRPWM_3 */
    INT_SRC_HRPWM_3_GCMP_A       = 224U,     /* HRPWM_3_GCMA */
    INT_SRC_HRPWM_3_GCMP_B       = 225U,     /* HRPWM_3_GCMB */
    INT_SRC_HRPWM_3_GCMP_C       = 226U,     /* HRPWM_3_GCMC */
    INT_SRC_HRPWM_3_GCMP_D       = 227U,     /* HRPWM_3_GCMD */
    INT_SRC_HRPWM_3_GCMP_E       = 228U,     /* HRPWM_3_GCME */
    INT_SRC_HRPWM_3_GCMP_F       = 229U,     /* HRPWM_3_GCMF */
    INT_SRC_HRPWM_3_OVF          = 230U,     /* HRPWM_3_GOVF */
    INT_SRC_HRPWM_3_UDF          = 231U,     /* HRPWM_3_GUDF */
    INT_SRC_HRPWM_3_SCMP_A       = 232U,     /* HRPWM_3_SCMA */
    INT_SRC_HRPWM_3_SCMP_B       = 233U,     /* HRPWM_3_SCMB */
    INT_SRC_HRPWM_3_GCAP_A       = 234U,     /* HRPWM_3_GCAPA */
    INT_SRC_HRPWM_3_GCAP_B       = 235U,     /* HRPWM_3_GCAPB */
    /*  HRPWM_4 */
    INT_SRC_HRPWM_4_GCMP_A       = 236U,     /* HRPWM_4_GCMA */
    INT_SRC_HRPWM_4_GCMP_B       = 237U,     /* HRPWM_4_GCMB */
    INT_SRC_HRPWM_4_GCMP_C       = 238U,     /* HRPWM_4_GCMC */
    INT_SRC_HRPWM_4_GCMP_D       = 239U,     /* HRPWM_4_GCMD */
    INT_SRC_HRPWM_4_GCMP_E       = 240U,     /* HRPWM_4_GCME */
    INT_SRC_HRPWM_4_GCMP_F       = 241U,     /* HRPWM_4_GCMF */
    INT_SRC_HRPWM_4_OVF          = 242U,     /* HRPWM_4_GOVF */
    INT_SRC_HRPWM_4_UDF          = 243U,     /* HRPWM_4_GUDF */
    INT_SRC_HRPWM_4_SCMP_A       = 244U,     /* HRPWM_4_SCMA */
    INT_SRC_HRPWM_4_SCMP_B       = 245U,     /* HRPWM_4_SCMB */
    INT_SRC_HRPWM_4_GCAP_A       = 246U,     /* HRPWM_4_GCAPA */
    INT_SRC_HRPWM_4_GCAP_B       = 247U,     /* HRPWM_4_GCAPB */
    /*  EMB_4_8  */
    INT_SRC_EMB_GR4              = 248U,     /* EMB_GR4 */
    INT_SRC_EMB_GR5              = 249U,     /* EMB_GR5 */
    INT_SRC_EMB_GR6              = 250U,     /* EMB_GR6 */
    INT_SRC_EMB_GR7              = 251U,     /* EMB_GR7 */
    INT_SRC_EMB_GR8              = 252U,     /* EMB_GR8 */
    /*  HRPWM_5 */
    INT_SRC_HRPWM_5_GCMP_A       = 256U,     /* HRPWM_5_GCMA */
    INT_SRC_HRPWM_5_GCMP_B       = 257U,     /* HRPWM_5_GCMB */
    INT_SRC_HRPWM_5_GCMP_C       = 258U,     /* HRPWM_5_GCMC */
    INT_SRC_HRPWM_5_GCMP_D       = 259U,     /* HRPWM_5_GCMD */
    INT_SRC_HRPWM_5_GCMP_E       = 260U,     /* HRPWM_5_GCME */
    INT_SRC_HRPWM_5_GCMP_F       = 261U,     /* HRPWM_5_GCMF */
    INT_SRC_HRPWM_5_OVF          = 262U,     /* HRPWM_5_GOVF */
    INT_SRC_HRPWM_5_UDF          = 263U,     /* HRPWM_5_GUDF */
    INT_SRC_HRPWM_5_SCMP_A       = 264U,     /* HRPWM_5_SCMA */
    INT_SRC_HRPWM_5_SCMP_B       = 265U,     /* HRPWM_5_SCMB */
    INT_SRC_HRPWM_5_GCAP_A       = 266U,     /* HRPWM_5_GCAPA */
    INT_SRC_HRPWM_5_GCAP_B       = 267U,     /* HRPWM_5_GCAPB */
    /*  HRPWM_6 */
    INT_SRC_HRPWM_6_GCMP_A       = 268U,     /* HRPWM_6_GCMA */
    INT_SRC_HRPWM_6_GCMP_B       = 269U,     /* HRPWM_6_GCMB */
    INT_SRC_HRPWM_6_GCMP_C       = 270U,     /* HRPWM_6_GCMC */
    INT_SRC_HRPWM_6_GCMP_D       = 271U,     /* HRPWM_6_GCMD */
    INT_SRC_HRPWM_6_GCMP_E       = 272U,     /* HRPWM_6_GCME */
    INT_SRC_HRPWM_6_GCMP_F       = 273U,     /* HRPWM_6_GCMF */
    INT_SRC_HRPWM_6_OVF          = 274U,     /* HRPWM_6_GOVF */
    INT_SRC_HRPWM_6_UDF          = 275U,     /* HRPWM_6_GUDF */
    INT_SRC_HRPWM_6_SCMP_A       = 276U,     /* HRPWM_6_SCMA */
    INT_SRC_HRPWM_6_SCMP_B       = 277U,     /* HRPWM_6_SCMB */
    INT_SRC_HRPWM_6_GCAP_A       = 278U,     /* HRPWM_6_GCAPA */
    INT_SRC_HRPWM_6_GCAP_B       = 279U,     /* HRPWM_6_GCAPB */
    /*  MCAN  */
    INT_SRC_MCANRAM_ECCER        = 282U,     /* MCANRAM_ECCER */
    INT_SRC_MCAN1_INT0           = 283U,     /* MCAN1_INT0 */
    INT_SRC_MCAN1_INT1           = 284U,     /* MCAN1_INT1 */
    INT_SRC_MCAN2_INT0           = 285U,     /* MCAN2_INT0 */
    INT_SRC_MCAN2_INT1           = 286U,     /* MCAN2_INT1 */
    /*  TIMER4  */
    INT_SRC_TMR4_GCMP_UH         = 288U,     /* TMR4_GCMUH */
    INT_SRC_TMR4_GCMP_UL         = 289U,     /* TMR4_GCMUL */
    INT_SRC_TMR4_GCMP_VH         = 290U,     /* TMR4_GCMVH */
    INT_SRC_TMR4_GCMP_VL         = 291U,     /* TMR4_GCMVL */
    INT_SRC_TMR4_GCMP_WH         = 292U,     /* TMR4_GCMWH */
    INT_SRC_TMR4_GCMP_WL         = 293U,     /* TMR4_GCMWL */
    INT_SRC_TMR4_GCMP_XH         = 294U,     /* TMR4_GCMXH */
    INT_SRC_TMR4_GCMP_XL         = 295U,     /* TMR4_GCMXL */
    INT_SRC_TMR4_OVF             = 296U,     /* TMR4_GOVF  */
    INT_SRC_TMR4_UDF             = 297U,     /* TMR4_GUDF  */
    INT_SRC_TMR4_RELOAD_U        = 298U,     /* TMR4_GRLU  */
    INT_SRC_TMR4_RELOAD_V        = 299U,     /* TMR4_GRLV  */
    INT_SRC_TMR4_RELOAD_W        = 300U,     /* TMR4_GRLW  */
    INT_SRC_TMR4_RELOAD_X        = 301U,     /* TMR4_GRLX  */
    INT_SRC_TMR4_SCMP0           = 302U,     /* TMR4_SCM0  */
    INT_SRC_TMR4_SCMP1           = 303U,     /* TMR4_SCM1  */
    INT_SRC_TMR4_SCMP2           = 304U,     /* TMR4_SCM2  */
    INT_SRC_TMR4_SCMP3           = 305U,     /* TMR4_SCM3  */
    INT_SRC_TMR4_SCMP4           = 306U,     /* TMR4_SCM4  */
    INT_SRC_TMR4_SCMP5           = 307U,     /* TMR4_SCM5  */
    INT_SRC_TMR4_SCMP6           = 308U,     /* TMR4_SCM6  */
    INT_SRC_TMR4_SCMP7           = 309U,     /* TMR4_SCM7  */
    /*  CMP  */
    INT_SRC_CMP1                 = 310U,     /* CMP_1_IRQ */
    INT_SRC_CMP2                 = 311U,     /* CMP_2_IRQ */
    INT_SRC_CMP3                 = 312U,     /* CMP_3_IRQ */
    /*  I2C  */
    INT_SRC_I2C_RXI              = 316U,     /* I2C_RXI */
    INT_SRC_I2C_TXI              = 317U,     /* I2C_TXI */
    INT_SRC_I2C_TEI              = 318U,     /* I2C_TEI */
    INT_SRC_I2C_EEI              = 319U,     /* I2C_EEI */
    /*  USART1  */
    INT_SRC_USART1_EI            = 321U,     /* USART_1_EI  */
    INT_SRC_USART1_RI            = 322U,     /* USART_1_RI  */
    INT_SRC_USART1_TI            = 323U,     /* USART_1_TI  */
    INT_SRC_USART1_RTO           = 324U,     /* USART_1_RTO */
    INT_SRC_USART1_TENDI         = 325U,     /* USART_1_TENDI */
    INT_SRC_USART1_TCI           = 326U,     /* USART_1_TCI */
    /*  SPI  */
    INT_SRC_SPI_SPRI             = 330U,     /* SPI_SPRI */
    INT_SRC_SPI_SPTI             = 331U,     /* SPI_SPTI */
    INT_SRC_SPI_SPII             = 332U,     /* SPI_SPII */
    INT_SRC_SPI_SPEI             = 333U,     /* SPI_SPEI */
    /*  TIMERA_5  */
    INT_SRC_TMRA_5_OVF           = 340U,     /* TMRA_5_OVF */
    INT_SRC_TMRA_5_UDF           = 341U,     /* TMRA_5_UDF */
    INT_SRC_TMRA_5_CMP           = 342U,     /* TMRA_5_CMP */
    /*  EVENT PORT  */
    INT_SRC_EVENT_PORT1          = 348U,     /* EVENT_PORT1 */
    INT_SRC_EVENT_PORT2          = 349U,     /* EVENT_PORT2 */
    INT_SRC_EVENT_PORT3          = 350U,     /* EVENT_PORT3 */
    INT_SRC_EVENT_PORT4          = 351U,     /* EVENT_PORT4 */
    /*  USART2  */
    INT_SRC_USART2_BRKWKPI       = 352U,     /* USART_2_BRKWKPI */
    INT_SRC_USART2_EI            = 353U,     /* USART_2_EI      */
    INT_SRC_USART2_RI            = 354U,     /* USART_2_RI      */
    INT_SRC_USART2_TI            = 355U,     /* USART_2_TI      */
    INT_SRC_USART2_RTO           = 356U,     /* USART_2_RTO     */
    INT_SRC_USART2_TENDI         = 357U,     /* USART_2_TENDI   */
    INT_SRC_USART2_TCI           = 358U,     /* USART_2_TCI     */
    /*  USART3  */
    INT_SRC_USART3_BRKWKPI       = 384U,     /* USART_3_BRKWKPI */
    INT_SRC_USART3_EI            = 385U,     /* USART_3_EI      */
    INT_SRC_USART3_RI            = 386U,     /* USART_3_RI      */
    INT_SRC_USART3_TI            = 387U,     /* USART_3_TI      */
    INT_SRC_USART3_RTO           = 388U,     /* USART_3_RTO     */
    INT_SRC_USART3_TENDI         = 389U,     /* USART_3_TENDI   */
    INT_SRC_USART3_TCI           = 390U,     /* USART_3_TCI     */
    /*  USART4  */
    INT_SRC_USART4_BRKWKPI       = 391U,     /* USART_4_BRKWKPI */
    INT_SRC_USART4_EI            = 392U,     /* USART_4_EI      */
    INT_SRC_USART4_RI            = 393U,     /* USART_4_RI      */
    INT_SRC_USART4_TI            = 394U,     /* USART_4_TI      */
    INT_SRC_USART4_RTO           = 395U,     /* USART_4_RTO     */
    INT_SRC_USART4_TENDI         = 396U,     /* USART_4_TENDI   */
    INT_SRC_USART4_TCI           = 397U,     /* USART_4_TCI     */
    /*  PLA  */
    INT_SRC_PLA_INT              = 431U,     /* PLA_INT */
    /*  USART1  */
    INT_SRC_USART1_WUPI          = 464U,     /* USART_1_WUPI */
    /*  LVD  */
    INT_SRC_LVD1                 = 465U,     /* LVD1 */
    INT_SRC_LVD2                 = 466U,     /* LVD2 */
    /*  FCM  */
    INT_SRC_FCMFERRI             = 468U,     /* FCMFERRI */
    INT_SRC_FCMMENDI             = 469U,     /* FCMMENDI */
    INT_SRC_FCMCOVFI             = 470U,     /* FCMCOVFI */
    /*  WDT  */
    INT_SRC_WDT_REFUDF           = 471U,     /* WDT_REFUDF */
    /*  CTC  */
    INT_SRC_CTC_ERR              = 472U,     /* CTC_ERR */
    /*  ADC1  */
    INT_SRC_ADC1_EOCA            = 480U,     /* ADC_1_EOCA */
    INT_SRC_ADC1_EOCB            = 481U,     /* ADC_1_EOCB */
    INT_SRC_ADC1_CMP0            = 482U,     /* ADC_1_CMP0 */
    INT_SRC_ADC1_CMP1            = 483U,     /* ADC_1_CMP1 */
    /*  ADC2  */
    INT_SRC_ADC2_EOCA            = 484U,     /* ADC_2_EOCA */
    INT_SRC_ADC2_EOCB            = 485U,     /* ADC_2_EOCB */
    INT_SRC_ADC2_CMP0            = 486U,     /* ADC_2_CMP0 */
    INT_SRC_ADC2_CMP1            = 487U,     /* ADC_2_CMP1 */
    /*  ADC3  */
    INT_SRC_ADC3_EOCA            = 488U,     /* ADC_3_EOCA */
    INT_SRC_ADC3_EOCB            = 489U,     /* ADC_3_EOCB */
    INT_SRC_ADC3_CMP0            = 490U,     /* ADC_3_CMP0 */
    INT_SRC_ADC3_CMP1            = 491U,     /* ADC_3_CMP1 */
    INT_SRC_MAX                  = 511U,
} en_int_src_t;

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/******************************************************************************/
/*                Device Specific Peripheral Registers structures             */
/******************************************************************************/

/**
 * @brief ADC
 */
typedef struct {
    __IO uint8_t  STR;
    uint8_t RESERVED0[1];
    __IO uint16_t CR0;
    __IO uint16_t CR1;
    __IO uint16_t CR2;
    uint8_t RESERVED1[2];
    __IO uint16_t TRGSR;
    __IO uint32_t CHSELRA;
    __IO uint32_t CHSELRB;
    __IO uint32_t AVCHSELR;
    __IO uint8_t  EXCHSELR;
    uint8_t RESERVED2[7];
    __IO uint8_t  SSTR0;
    __IO uint8_t  SSTR1;
    __IO uint8_t  SSTR2;
    __IO uint8_t  SSTR3;
    __IO uint8_t  SSTR4;
    __IO uint8_t  SSTR5;
    __IO uint8_t  SSTR6;
    __IO uint8_t  SSTR7;
    __IO uint8_t  SSTR8;
    __IO uint8_t  SSTR9;
    __IO uint8_t  SSTR10;
    __IO uint8_t  SSTR11;
    __IO uint8_t  SSTR12;
    __IO uint8_t  SSTR13;
    __IO uint8_t  SSTR14;
    __IO uint8_t  SSTR15;
    uint8_t RESERVED3[8];
    __IO uint16_t CHMUXR0;
    __IO uint16_t CHMUXR1;
    __IO uint16_t CHMUXR2;
    __IO uint16_t CHMUXR3;
    uint8_t RESERVED4[4];
    __I  uint8_t  ISR;
    __IO uint8_t  ICR;
    __O  uint8_t  ISCLRR;
    uint8_t RESERVED5[5];
    __IO uint16_t SYNCCR;
    uint8_t RESERVED6[2];
    __I  uint16_t DR0;
    __I  uint16_t DR1;
    __I  uint16_t DR2;
    __I  uint16_t DR3;
    __I  uint16_t DR4;
    __I  uint16_t DR5;
    __I  uint16_t DR6;
    __I  uint16_t DR7;
    __I  uint16_t DR8;
    __I  uint16_t DR9;
    __I  uint16_t DR10;
    __I  uint16_t DR11;
    __I  uint16_t DR12;
    __I  uint16_t DR13;
    __I  uint16_t DR14;
    __I  uint16_t DR15;
    uint8_t RESERVED7[48];
    __IO uint16_t AWDCR;
    __I  uint8_t  AWDSR;
    __O  uint8_t  AWDSCLRR;
    __IO uint16_t AWD0DR0;
    __IO uint16_t AWD0DR1;
    __IO uint8_t  AWD0CHSR;
    uint8_t RESERVED8[3];
    __IO uint16_t AWD1DR0;
    __IO uint16_t AWD1DR1;
    __IO uint8_t  AWD1CHSR;
} CM_ADC_TypeDef;

