levizh/hc32-f4-cmsis/Device/HDSC/hc32f334/Include/hc32f334.h
/*  Bit definition for HRPWM_HCLRR2 register  */
#define HRPWM_HCLRR2_HCLREXEV1_POS                     (0U)
#define HRPWM_HCLRR2_HCLREXEV1                         (0x00000001UL)
#define HRPWM_HCLRR2_HCLREXEV2_POS                     (1U)
#define HRPWM_HCLRR2_HCLREXEV2                         (0x00000002UL)
#define HRPWM_HCLRR2_HCLREXEV3_POS                     (2U)
#define HRPWM_HCLRR2_HCLREXEV3                         (0x00000004UL)
#define HRPWM_HCLRR2_HCLREXEV4_POS                     (3U)
#define HRPWM_HCLRR2_HCLREXEV4                         (0x00000008UL)
#define HRPWM_HCLRR2_HCLREXEV5_POS                     (4U)
#define HRPWM_HCLRR2_HCLREXEV5                         (0x00000010UL)
#define HRPWM_HCLRR2_HCLREXEV6_POS                     (5U)
#define HRPWM_HCLRR2_HCLREXEV6                         (0x00000020UL)
#define HRPWM_HCLRR2_HCLREXEV7_POS                     (6U)
#define HRPWM_HCLRR2_HCLREXEV7                         (0x00000040UL)
#define HRPWM_HCLRR2_HCLREXEV8_POS                     (7U)
#define HRPWM_HCLRR2_HCLREXEV8                         (0x00000080UL)
#define HRPWM_HCLRR2_HCLREXEV9_POS                     (8U)
#define HRPWM_HCLRR2_HCLREXEV9                         (0x00000100UL)
#define HRPWM_HCLRR2_HCLREXEV10_POS                    (9U)
#define HRPWM_HCLRR2_HCLREXEV10                        (0x00000200UL)
#define HRPWM_HCLRR2_HCLRGCMA1_POS                     (10U)
#define HRPWM_HCLRR2_HCLRGCMA1                         (0x00000400UL)
#define HRPWM_HCLRR2_HCLRGCMB1_POS                     (11U)
#define HRPWM_HCLRR2_HCLRGCMB1                         (0x00000800UL)
#define HRPWM_HCLRR2_HCLRGCMA2_POS                     (12U)
#define HRPWM_HCLRR2_HCLRGCMA2                         (0x00001000UL)
#define HRPWM_HCLRR2_HCLRGCMB2_POS                     (13U)
#define HRPWM_HCLRR2_HCLRGCMB2                         (0x00002000UL)
#define HRPWM_HCLRR2_HCLRGCMA3_POS                     (14U)
#define HRPWM_HCLRR2_HCLRGCMA3                         (0x00004000UL)
#define HRPWM_HCLRR2_HCLRGCMB3_POS                     (15U)
#define HRPWM_HCLRR2_HCLRGCMB3                         (0x00008000UL)
#define HRPWM_HCLRR2_HCLRGCMA4_POS                     (16U)
#define HRPWM_HCLRR2_HCLRGCMA4                         (0x00010000UL)
#define HRPWM_HCLRR2_HCLRGCMB4_POS                     (17U)
#define HRPWM_HCLRR2_HCLRGCMB4                         (0x00020000UL)
#define HRPWM_HCLRR2_HCLRGCMA5_POS                     (18U)
#define HRPWM_HCLRR2_HCLRGCMA5                         (0x00040000UL)
#define HRPWM_HCLRR2_HCLRGCMB5_POS                     (19U)
#define HRPWM_HCLRR2_HCLRGCMB5                         (0x00080000UL)
#define HRPWM_HCLRR2_HCLRGCMA6_POS                     (20U)
#define HRPWM_HCLRR2_HCLRGCMA6                         (0x00100000UL)
#define HRPWM_HCLRR2_HCLRGCMB6_POS                     (21U)
#define HRPWM_HCLRR2_HCLRGCMB6                         (0x00200000UL)
#define HRPWM_HCLRR2_HCLRSCMB1_POS                     (22U)
#define HRPWM_HCLRR2_HCLRSCMB1                         (0x00400000UL)
#define HRPWM_HCLRR2_HCLRSCMB2_POS                     (23U)
#define HRPWM_HCLRR2_HCLRSCMB2                         (0x00800000UL)
#define HRPWM_HCLRR2_HCLRSCMB3_POS                     (24U)
#define HRPWM_HCLRR2_HCLRSCMB3                         (0x01000000UL)
#define HRPWM_HCLRR2_HCLRSCMB4_POS                     (25U)
#define HRPWM_HCLRR2_HCLRSCMB4                         (0x02000000UL)
#define HRPWM_HCLRR2_HCLRSCMB5_POS                     (26U)
#define HRPWM_HCLRR2_HCLRSCMB5                         (0x04000000UL)
#define HRPWM_HCLRR2_HCLRSCMB6_POS                     (27U)
#define HRPWM_HCLRR2_HCLRSCMB6                         (0x08000000UL)

/*  Bit definition for HRPWM_EEFOFFSETAR register  */
#define HRPWM_EEFOFFSETAR_OFFSET_POS                   (0U)
#define HRPWM_EEFOFFSETAR_OFFSET                       (0x003FFFFFUL)
#define HRPWM_EEFOFFSETAR_OFFSETDIR_POS                (22U)
#define HRPWM_EEFOFFSETAR_OFFSETDIR                    (0x00400000UL)

/*  Bit definition for HRPWM_EEFOFFSETBR register  */
#define HRPWM_EEFOFFSETBR_OFFSET_POS                   (0U)
#define HRPWM_EEFOFFSETBR_OFFSET                       (0x003FFFFFUL)
#define HRPWM_EEFOFFSETBR_OFFSETDIR_POS                (22U)
#define HRPWM_EEFOFFSETBR_OFFSETDIR                    (0x00400000UL)

/*  Bit definition for HRPWM_EEFWINAR register  */
#define HRPWM_EEFWINAR_WIN_POS                         (0U)
#define HRPWM_EEFWINAR_WIN                             (0x003FFFFFUL)
#define HRPWM_EEFWINAR_WINDIR_POS                      (22U)
#define HRPWM_EEFWINAR_WINDIR                          (0x00400000UL)

/*  Bit definition for HRPWM_EEFWINBR register  */
#define HRPWM_EEFWINBR_WIN_POS                         (0U)
#define HRPWM_EEFWINBR_WIN                             (0x003FFFFFUL)
#define HRPWM_EEFWINBR_WINDIR_POS                      (22U)
#define HRPWM_EEFWINBR_WINDIR                          (0x00400000UL)

/*  Bit definition for HRPWM_EEFLTCR1 register  */
#define HRPWM_EEFLTCR1_EE1LAT_POS                      (0U)
#define HRPWM_EEFLTCR1_EE1LAT                          (0x00000001UL)
#define HRPWM_EEFLTCR1_EE1FM_POS                       (1U)
#define HRPWM_EEFLTCR1_EE1FM                           (0x0000001EUL)
#define HRPWM_EEFLTCR1_EE1TMO_POS                      (5U)
#define HRPWM_EEFLTCR1_EE1TMO                          (0x00000020UL)
#define HRPWM_EEFLTCR1_EE2LAT_POS                      (6U)
#define HRPWM_EEFLTCR1_EE2LAT                          (0x00000040UL)
#define HRPWM_EEFLTCR1_EE2FM_POS                       (7U)
#define HRPWM_EEFLTCR1_EE2FM                           (0x00000780UL)
#define HRPWM_EEFLTCR1_EE2TMO_POS                      (11U)
#define HRPWM_EEFLTCR1_EE2TMO                          (0x00000800UL)
#define HRPWM_EEFLTCR1_EE3LAT_POS                      (12U)
#define HRPWM_EEFLTCR1_EE3LAT                          (0x00001000UL)
#define HRPWM_EEFLTCR1_EE3FM_POS                       (13U)
#define HRPWM_EEFLTCR1_EE3FM                           (0x0001E000UL)
#define HRPWM_EEFLTCR1_EE3TMO_POS                      (17U)
#define HRPWM_EEFLTCR1_EE3TMO                          (0x00020000UL)
#define HRPWM_EEFLTCR1_EE4LAT_POS                      (18U)
#define HRPWM_EEFLTCR1_EE4LAT                          (0x00040000UL)
#define HRPWM_EEFLTCR1_EE4FM_POS                       (19U)
#define HRPWM_EEFLTCR1_EE4FM                           (0x00780000UL)
#define HRPWM_EEFLTCR1_EE4TMO_POS                      (23U)
#define HRPWM_EEFLTCR1_EE4TMO                          (0x00800000UL)
#define HRPWM_EEFLTCR1_EE5LAT_POS                      (24U)
#define HRPWM_EEFLTCR1_EE5LAT                          (0x01000000UL)
#define HRPWM_EEFLTCR1_EE5FM_POS                       (25U)
#define HRPWM_EEFLTCR1_EE5FM                           (0x1E000000UL)
#define HRPWM_EEFLTCR1_EE5TMO_POS                      (29U)
#define HRPWM_EEFLTCR1_EE5TMO                          (0x20000000UL)
#define HRPWM_EEFLTCR1_EEINTPOL_POS                    (30U)
#define HRPWM_EEFLTCR1_EEINTPOL                        (0x40000000UL)

/*  Bit definition for HRPWM_EEFLTCR2 register  */
#define HRPWM_EEFLTCR2_EE6LAT_POS                      (0U)
#define HRPWM_EEFLTCR2_EE6LAT                          (0x00000001UL)
#define HRPWM_EEFLTCR2_EE6FM_POS                       (1U)
#define HRPWM_EEFLTCR2_EE6FM                           (0x0000001EUL)
#define HRPWM_EEFLTCR2_EE6TMO_POS                      (5U)
#define HRPWM_EEFLTCR2_EE6TMO                          (0x00000020UL)
#define HRPWM_EEFLTCR2_EE7LAT_POS                      (6U)
#define HRPWM_EEFLTCR2_EE7LAT                          (0x00000040UL)
#define HRPWM_EEFLTCR2_EE7FM_POS                       (7U)
#define HRPWM_EEFLTCR2_EE7FM                           (0x00000780UL)
#define HRPWM_EEFLTCR2_EE7TMO_POS                      (11U)
#define HRPWM_EEFLTCR2_EE7TMO                          (0x00000800UL)
#define HRPWM_EEFLTCR2_EE8LAT_POS                      (12U)
#define HRPWM_EEFLTCR2_EE8LAT                          (0x00001000UL)
#define HRPWM_EEFLTCR2_EE8FM_POS                       (13U)
#define HRPWM_EEFLTCR2_EE8FM                           (0x0001E000UL)
#define HRPWM_EEFLTCR2_EE8TMO_POS                      (17U)
#define HRPWM_EEFLTCR2_EE8TMO                          (0x00020000UL)
#define HRPWM_EEFLTCR2_EE9LAT_POS                      (18U)
#define HRPWM_EEFLTCR2_EE9LAT                          (0x00040000UL)
#define HRPWM_EEFLTCR2_EE9FM_POS                       (19U)
#define HRPWM_EEFLTCR2_EE9FM                           (0x00780000UL)
#define HRPWM_EEFLTCR2_EE9TMO_POS                      (23U)
#define HRPWM_EEFLTCR2_EE9TMO                          (0x00800000UL)
#define HRPWM_EEFLTCR2_EE10LAT_POS                     (24U)
#define HRPWM_EEFLTCR2_EE10LAT                         (0x01000000UL)
#define HRPWM_EEFLTCR2_EE10FM_POS                      (25U)
#define HRPWM_EEFLTCR2_EE10FM                          (0x1E000000UL)
#define HRPWM_EEFLTCR2_EE10TMO_POS                     (29U)
#define HRPWM_EEFLTCR2_EE10TMO                         (0x20000000UL)

/*  Bit definition for HRPWM_PCNAR3 register  */
#define HRPWM_PCNAR3_EXEV1DCA_POS                      (0U)
#define HRPWM_PCNAR3_EXEV1DCA                          (0x00000003UL)
#define HRPWM_PCNAR3_EXEV1DCA_0                        (0x00000001UL)
#define HRPWM_PCNAR3_EXEV1DCA_1                        (0x00000002UL)
#define HRPWM_PCNAR3_EXEV2DCA_POS                      (2U)
#define HRPWM_PCNAR3_EXEV2DCA                          (0x0000000CUL)
#define HRPWM_PCNAR3_EXEV2DCA_0                        (0x00000004UL)
#define HRPWM_PCNAR3_EXEV2DCA_1                        (0x00000008UL)
#define HRPWM_PCNAR3_EXEV3DCA_POS                      (4U)
#define HRPWM_PCNAR3_EXEV3DCA                          (0x00000030UL)
#define HRPWM_PCNAR3_EXEV3DCA_0                        (0x00000010UL)
#define HRPWM_PCNAR3_EXEV3DCA_1                        (0x00000020UL)
#define HRPWM_PCNAR3_EXEV4DCA_POS                      (6U)
#define HRPWM_PCNAR3_EXEV4DCA                          (0x000000C0UL)
#define HRPWM_PCNAR3_EXEV4DCA_0                        (0x00000040UL)
#define HRPWM_PCNAR3_EXEV4DCA_1                        (0x00000080UL)
#define HRPWM_PCNAR3_EXEV5DCA_POS                      (8U)
#define HRPWM_PCNAR3_EXEV5DCA                          (0x00000300UL)
#define HRPWM_PCNAR3_EXEV5DCA_0                        (0x00000100UL)
#define HRPWM_PCNAR3_EXEV5DCA_1                        (0x00000200UL)
#define HRPWM_PCNAR3_EXEV6DCA_POS                      (10U)
#define HRPWM_PCNAR3_EXEV6DCA                          (0x00000C00UL)
#define HRPWM_PCNAR3_EXEV6DCA_0                        (0x00000400UL)
#define HRPWM_PCNAR3_EXEV6DCA_1                        (0x00000800UL)
#define HRPWM_PCNAR3_EXEV7DCA_POS                      (12U)
#define HRPWM_PCNAR3_EXEV7DCA                          (0x00003000UL)
#define HRPWM_PCNAR3_EXEV7DCA_0                        (0x00001000UL)
#define HRPWM_PCNAR3_EXEV7DCA_1                        (0x00002000UL)
#define HRPWM_PCNAR3_EXEV8DCA_POS                      (14U)
#define HRPWM_PCNAR3_EXEV8DCA                          (0x0000C000UL)
#define HRPWM_PCNAR3_EXEV8DCA_0                        (0x00004000UL)
#define HRPWM_PCNAR3_EXEV8DCA_1                        (0x00008000UL)
#define HRPWM_PCNAR3_EXEV9DCA_POS                      (16U)
#define HRPWM_PCNAR3_EXEV9DCA                          (0x00030000UL)
#define HRPWM_PCNAR3_EXEV9DCA_0                        (0x00010000UL)
#define HRPWM_PCNAR3_EXEV9DCA_1                        (0x00020000UL)
#define HRPWM_PCNAR3_EXEV10DCA_POS                     (18U)
#define HRPWM_PCNAR3_EXEV10DCA                         (0x000C0000UL)
#define HRPWM_PCNAR3_EXEV10DCA_0                       (0x00040000UL)
#define HRPWM_PCNAR3_EXEV10DCA_1                       (0x00080000UL)
#define HRPWM_PCNAR3_CMEDCA_POS                        (20U)
#define HRPWM_PCNAR3_CMEDCA                            (0x00300000UL)
#define HRPWM_PCNAR3_CMEDCA_0                          (0x00100000UL)
#define HRPWM_PCNAR3_CMEDCA_1                          (0x00200000UL)
#define HRPWM_PCNAR3_CMFDCA_POS                        (22U)
#define HRPWM_PCNAR3_CMFDCA                            (0x00C00000UL)
#define HRPWM_PCNAR3_CMFDCA_0                          (0x00400000UL)
#define HRPWM_PCNAR3_CMFDCA_1                          (0x00800000UL)
#define HRPWM_PCNAR3_SCMADCA_POS                       (24U)
#define HRPWM_PCNAR3_SCMADCA                           (0x03000000UL)
#define HRPWM_PCNAR3_SCMADCA_0                         (0x01000000UL)
#define HRPWM_PCNAR3_SCMADCA_1                         (0x02000000UL)
#define HRPWM_PCNAR3_SCMBDCA_POS                       (26U)
#define HRPWM_PCNAR3_SCMBDCA                           (0x0C000000UL)
#define HRPWM_PCNAR3_SCMBDCA_0                         (0x04000000UL)
#define HRPWM_PCNAR3_SCMBDCA_1                         (0x08000000UL)

