levizh/hc32-f4-cmsis/Device/HDSC/hc32f334/Include/hc32f334.h
/*  Bit definition for HRPWM_COMMON_SSTARUNR1 register  */
#define HRPWM_COMMON_SSTARUNR1_SSTARUN1A_POS           (0U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN1A               (0x00000001UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN1B_POS           (1U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN1B               (0x00000002UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN2A_POS           (2U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN2A               (0x00000004UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN2B_POS           (3U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN2B               (0x00000008UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN3A_POS           (4U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN3A               (0x00000010UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN3B_POS           (5U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN3B               (0x00000020UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN4A_POS           (6U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN4A               (0x00000040UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN4B_POS           (7U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN4B               (0x00000080UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN5A_POS           (8U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN5A               (0x00000100UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN5B_POS           (9U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN5B               (0x00000200UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN6A_POS           (10U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN6A               (0x00000400UL)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN6B_POS           (11U)
#define HRPWM_COMMON_SSTARUNR1_SSTARUN6B               (0x00000800UL)

/*  Bit definition for HRPWM_COMMON_SSTARUNR2 register  */
#define HRPWM_COMMON_SSTARUNR2_SSTARUN1A2_POS          (0U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN1A2              (0x00000001UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN1B2_POS          (1U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN1B2              (0x00000002UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN2A2_POS          (2U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN2A2              (0x00000004UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN2B2_POS          (3U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN2B2              (0x00000008UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN3A2_POS          (4U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN3A2              (0x00000010UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN3B2_POS          (5U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN3B2              (0x00000020UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN4A2_POS          (6U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN4A2              (0x00000040UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN4B2_POS          (7U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN4B2              (0x00000080UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN5A2_POS          (8U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN5A2              (0x00000100UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN5B2_POS          (9U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN5B2              (0x00000200UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN6A2_POS          (10U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN6A2              (0x00000400UL)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN6B2_POS          (11U)
#define HRPWM_COMMON_SSTARUNR2_SSTARUN6B2              (0x00000800UL)

/*  Bit definition for HRPWM_COMMON_SSTADIDLR register  */
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU1_POS           (0U)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU1               (0x00000001UL)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU2_POS           (1U)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU2               (0x00000002UL)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU3_POS           (2U)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU3               (0x00000004UL)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU4_POS           (3U)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU4               (0x00000008UL)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU5_POS           (4U)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU5               (0x00000010UL)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU6_POS           (5U)
#define HRPWM_COMMON_SSTADIDLR_DLYSTRGU6               (0x00000020UL)

/*  Bit definition for HRPWM_COMMON_GCTLR register  */
#define HRPWM_COMMON_GCTLR_EE1SRC2_POS                 (0U)
#define HRPWM_COMMON_GCTLR_EE1SRC2                     (0x00000003UL)
#define HRPWM_COMMON_GCTLR_EE1SRC2_0                   (0x00000001UL)
#define HRPWM_COMMON_GCTLR_EE1SRC2_1                   (0x00000002UL)
#define HRPWM_COMMON_GCTLR_EE2SRC2_POS                 (2U)
#define HRPWM_COMMON_GCTLR_EE2SRC2                     (0x0000000CUL)
#define HRPWM_COMMON_GCTLR_EE2SRC2_0                   (0x00000004UL)
#define HRPWM_COMMON_GCTLR_EE2SRC2_1                   (0x00000008UL)
#define HRPWM_COMMON_GCTLR_BKDLY1_POS                  (4U)
#define HRPWM_COMMON_GCTLR_BKDLY1                      (0x00000010UL)
#define HRPWM_COMMON_GCTLR_BKDLY2_POS                  (5U)
#define HRPWM_COMMON_GCTLR_BKDLY2                      (0x00000020UL)
#define HRPWM_COMMON_GCTLR_BKDLY3_POS                  (6U)
#define HRPWM_COMMON_GCTLR_BKDLY3                      (0x00000040UL)
#define HRPWM_COMMON_GCTLR_BKDLY4_POS                  (7U)
#define HRPWM_COMMON_GCTLR_BKDLY4                      (0x00000080UL)
#define HRPWM_COMMON_GCTLR_BKDLY5_POS                  (8U)
#define HRPWM_COMMON_GCTLR_BKDLY5                      (0x00000100UL)
#define HRPWM_COMMON_GCTLR_BKDLY6_POS                  (9U)
#define HRPWM_COMMON_GCTLR_BKDLY6                      (0x00000200UL)
#define HRPWM_COMMON_GCTLR_EE3SRC2_POS                 (16U)
#define HRPWM_COMMON_GCTLR_EE3SRC2                     (0x00030000UL)
#define HRPWM_COMMON_GCTLR_EE3SRC2_0                   (0x00010000UL)
#define HRPWM_COMMON_GCTLR_EE3SRC2_1                   (0x00020000UL)
#define HRPWM_COMMON_GCTLR_EE4SRC2_POS                 (18U)
#define HRPWM_COMMON_GCTLR_EE4SRC2                     (0x000C0000UL)
#define HRPWM_COMMON_GCTLR_EE4SRC2_0                   (0x00040000UL)
#define HRPWM_COMMON_GCTLR_EE4SRC2_1                   (0x00080000UL)
#define HRPWM_COMMON_GCTLR_EE5SRC2_POS                 (20U)
#define HRPWM_COMMON_GCTLR_EE5SRC2                     (0x00300000UL)
#define HRPWM_COMMON_GCTLR_EE5SRC2_0                   (0x00100000UL)
#define HRPWM_COMMON_GCTLR_EE5SRC2_1                   (0x00200000UL)
#define HRPWM_COMMON_GCTLR_EE6SRC2_POS                 (22U)
#define HRPWM_COMMON_GCTLR_EE6SRC2                     (0x00C00000UL)
#define HRPWM_COMMON_GCTLR_EE6SRC2_0                   (0x00400000UL)
#define HRPWM_COMMON_GCTLR_EE6SRC2_1                   (0x00800000UL)
#define HRPWM_COMMON_GCTLR_EE7SRC2_POS                 (24U)
#define HRPWM_COMMON_GCTLR_EE7SRC2                     (0x03000000UL)
#define HRPWM_COMMON_GCTLR_EE7SRC2_0                   (0x01000000UL)
#define HRPWM_COMMON_GCTLR_EE7SRC2_1                   (0x02000000UL)
#define HRPWM_COMMON_GCTLR_EE8SRC2_POS                 (26U)
#define HRPWM_COMMON_GCTLR_EE8SRC2                     (0x0C000000UL)
#define HRPWM_COMMON_GCTLR_EE8SRC2_0                   (0x04000000UL)
#define HRPWM_COMMON_GCTLR_EE8SRC2_1                   (0x08000000UL)
#define HRPWM_COMMON_GCTLR_EE9SRC2_POS                 (28U)
#define HRPWM_COMMON_GCTLR_EE9SRC2                     (0x30000000UL)
#define HRPWM_COMMON_GCTLR_EE9SRC2_0                   (0x10000000UL)
#define HRPWM_COMMON_GCTLR_EE9SRC2_1                   (0x20000000UL)
#define HRPWM_COMMON_GCTLR_EE10SRC2_POS                (30U)
#define HRPWM_COMMON_GCTLR_EE10SRC2                    (0xC0000000UL)
#define HRPWM_COMMON_GCTLR_EE10SRC2_0                  (0x40000000UL)
#define HRPWM_COMMON_GCTLR_EE10SRC2_1                  (0x80000000UL)

/*  Bit definition for HRPWM_COMMON_GBCONR register  */
#define HRPWM_COMMON_GBCONR_BTRU1EN_POS                (0U)
#define HRPWM_COMMON_GBCONR_BTRU1EN                    (0x00000001UL)
#define HRPWM_COMMON_GBCONR_BTRU2EN_POS                (1U)
#define HRPWM_COMMON_GBCONR_BTRU2EN                    (0x00000002UL)
#define HRPWM_COMMON_GBCONR_BTRU3EN_POS                (2U)
#define HRPWM_COMMON_GBCONR_BTRU3EN                    (0x00000004UL)
#define HRPWM_COMMON_GBCONR_BTRU4EN_POS                (3U)
#define HRPWM_COMMON_GBCONR_BTRU4EN                    (0x00000008UL)
#define HRPWM_COMMON_GBCONR_BTRU5EN_POS                (4U)
#define HRPWM_COMMON_GBCONR_BTRU5EN                    (0x00000010UL)
#define HRPWM_COMMON_GBCONR_BTRU6EN_POS                (5U)
#define HRPWM_COMMON_GBCONR_BTRU6EN                    (0x00000020UL)
#define HRPWM_COMMON_GBCONR_BTRU1SFT_POS               (8U)
#define HRPWM_COMMON_GBCONR_BTRU1SFT                   (0x00000100UL)
#define HRPWM_COMMON_GBCONR_BTRU2SFT_POS               (9U)
#define HRPWM_COMMON_GBCONR_BTRU2SFT                   (0x00000200UL)
#define HRPWM_COMMON_GBCONR_BTRU3SFT_POS               (10U)
#define HRPWM_COMMON_GBCONR_BTRU3SFT                   (0x00000400UL)
#define HRPWM_COMMON_GBCONR_BTRU4SFT_POS               (11U)
#define HRPWM_COMMON_GBCONR_BTRU4SFT                   (0x00000800UL)
#define HRPWM_COMMON_GBCONR_BTRU5SFT_POS               (12U)
#define HRPWM_COMMON_GBCONR_BTRU5SFT                   (0x00001000UL)
#define HRPWM_COMMON_GBCONR_BTRU6SFT_POS               (13U)
#define HRPWM_COMMON_GBCONR_BTRU6SFT                   (0x00002000UL)
#define HRPWM_COMMON_GBCONR_OSTBTRU1_POS               (30U)
#define HRPWM_COMMON_GBCONR_OSTBTRU1                   (0x40000000UL)
#define HRPWM_COMMON_GBCONR_OSTENU1_POS                (31U)
#define HRPWM_COMMON_GBCONR_OSTENU1                    (0x80000000UL)

